In [67]:
import numpy as np
import pandas as pd

# Pandas series

In [70]:
l = [10,20,30]

s = pd.Series(l)
print(s)

0    10
1    20
2    30
dtype: int64

In [72]:
type(s)

pandas.core.series.Series

In [74]:
s.shape

(3,)

In [76]:
l = [10,20,30]

s = pd.Series(l,index = ["a","b","c"])
print(s)

a    10
b    20
c    30
dtype: int64

#### series using 1D array

In [79]:
a = np.array([10,20,30])

s=pd.Series(a)
print(s)

0    10
1    20
2    30
dtype: int32

In [81]:
s = pd.Series(a)
print(s)

0    10
1    20
2    30
dtype: int32

In [83]:
a = np.array([10,20,30])

s=pd.Series(a, index = ["a","b","c"])
print(s)

a    10
b    20
c    30
dtype: int32

#### using dictionary

In [86]:
d = {'a':1 , 'b':2 , 'c':3 , 'd':4}
s= pd.Series(d)
print(s)

a    1
b    2
c    3
d    4
dtype: int64

### DataFrame

In [89]:
d = {'c1':[1,2] , 'c2':[3,4]}
s = pd.Series(d)
print(s)

c1    [1, 2]
c2    [3, 4]
dtype: object

In [91]:
d = {'c1':[1,2] , 'c2':[3,4]}
df = pd.DataFrame(d)
df

   c1  c2
0   1   3
1   2   4

In [93]:
type(df)

pandas.core.frame.DataFrame

In [95]:
df.shape

(2, 2)

In [97]:
data = [[1,2,3,4],[5,6,7,8]]

df = pd.DataFrame(data,columns = ["a","b","c","d"])
df

   a  b  c  d
0  1  2  3  4
1  5  6  7  8

In [99]:
arr_2d = ([[1,2,3,4],[5,6,7,8]])

df2 = pd.DataFrame(arr_2d,index = ['a','b'],columns = ['m','r','k','s'])
print(df2)

   m  r  k  s
a  1  2  3  4
b  5  6  7  8

### Pandas

In [102]:
df = pd.DataFrame({'Age':[10,20,30,40],
                   'Salary':[1000,2000,3000,4000],
                   'Gender':['M','M','F','M']})
df

   Age  Salary Gender
0   10    1000      M
1   20    2000      M
2   30    3000      F
3   40    4000      M

In [120]:
df1 = df.set_index("Age")
df1

     Salary Gender
Age
10     1000      M
20     2000      M
30     3000      F
40     4000      M

In [122]:
df1.reset_index()

   Age  Salary Gender
0   10    1000      M
1   20    2000      M
2   30    3000      F
3   40    4000      M

#### Drop

In [126]:
df1 = df.drop(index=[3])
df1

   Age  Salary Gender
0   10    1000      M
1   20    2000      M
2   30    3000      F

In [138]:
df1 = df.drop(index=[0,1,2])
print(df1)

   Age  Salary Gender
3   40    4000      M

   Salary Gender
0    1000      M
1    2000      M
2    3000      F
3    4000      M

In [140]:
df1 = df.drop(columns = ["Age"])
df1

   Salary Gender
0    1000      M
1    2000      M
2    3000      F
3    4000      M

In [144]:
df1 = df.drop(columns = ["Age","Gender"])
df1

   Salary
0    1000
1    2000
2    3000
3    4000

In [146]:
df1 = df.drop(index=[0,1,2],columns = ["Age"])
print(df1)

   Salary Gender
3    4000      M

#### Sort

In [156]:
df.sort_values(by = "Age",ascending = True)

   Age  Salary Gender
0   10    1000      M
1   20    2000      M
2   30    3000      F
3   40    4000      M

In [158]:
df.sort_values(by = "Age",ascending = False)

   Age  Salary Gender
3   40    4000      M
2   30    3000      F
1   20    2000      M
0   10    1000      M

##### combing dataframe

In [163]:
df1 = pd.DataFrame({"city":["mumbai","delhi","hyedrabad","banglore"],
                   "temprature":[32,45,52,60]})
df1

        city  temprature
0     mumbai          32
1      delhi          45
2  hyedrabad          52
3   banglore          60

In [183]:
df2 = pd.DataFrame({"city":["mumbai","delhi","chennai","nagpur"],
                   "humidity":[32,53,18,24]})
df2

      city  humidity
0   mumbai        32
1    delhi        53
2  chennai        18
3   nagpur        24

In [185]:
pd.concat([df1,df2])

        city  temprature  humidity
0     mumbai        32.0       NaN
1      delhi        45.0       NaN
2  hyedrabad        52.0       NaN
3   banglore        60.0       NaN
0     mumbai         NaN      32.0
1      delhi         NaN      53.0
2    chennai         NaN      18.0
3     nagpur         NaN      24.0

In [187]:
pd.concat([df1,df2],axis = 0)

        city  temprature  humidity
0     mumbai        32.0       NaN
1      delhi        45.0       NaN
2  hyedrabad        52.0       NaN
3   banglore        60.0       NaN
0     mumbai         NaN      32.0
1      delhi         NaN      53.0
2    chennai         NaN      18.0
3     nagpur         NaN      24.0

In [189]:
pd.concat([df1,df2],axis = 1)

        city  temprature     city  humidity
0     mumbai          32   mumbai        32
1      delhi          45    delhi        53
2  hyedrabad          52  chennai        18
3   banglore          60   nagpur        24

In [191]:
pd.concat([df1,df2],ignore_index=True)

        city  temprature  humidity
0     mumbai        32.0       NaN
1      delhi        45.0       NaN
2  hyedrabad        52.0       NaN
3   banglore        60.0       NaN
4     mumbai         NaN      32.0
5      delhi         NaN      53.0
6    chennai         NaN      18.0
7     nagpur         NaN      24.0

#### merging

In [194]:
left_df = pd.merge(df1,df2, on = 'city' , how='left')
left_df

        city  temprature  humidity
0     mumbai          32      32.0
1      delhi          45      53.0
2  hyedrabad          52       NaN
3   banglore          60       NaN

In [196]:
right_df = pd.merge(df1,df2, on = 'city' , how = 'right')
right_df

      city  temprature  humidity
0   mumbai        32.0        32
1    delhi        45.0        53
2  chennai         NaN        18
3   nagpur         NaN        24

In [198]:
inner_df = pd.merge(df1,df2, on = 'city' , how='inner')
inner_df

     city  temprature  humidity
0  mumbai          32        32
1   delhi          45        53

In [200]:
outer_df = pd.merge(df1,df2, on = 'city' , how='outer')
outer_df

        city  temprature  humidity
0   banglore        60.0       NaN
1    chennai         NaN      18.0
2      delhi        45.0      53.0
3  hyedrabad        52.0       NaN
4     mumbai        32.0      32.0
5     nagpur         NaN      24.0